W6D5/cats99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
        # debugger
        # fail
        @cat = Cat.new(user_params)
        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "name" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "brown"], ["name", "NEWCAT EDITED"], ["description", "  Enter a description...\r\nasdf"], ["updated_at", "2019-11-23 00:26:46.780005"], ["id", 6]]
---
    def update
    @cat = Cat.find(params[:id])
    if @cat.update!(user_params)